{
  "meta": {
    "dataset_name": "risk_engineering_v1_hrg_master_map",
    "version": "v1.0",
    "status": "locked_reference_data",
    "default_weight": 3,
    "rating_scale": "engineer_rates_current_condition_1_to_5",
    "calculation_note": "overall_section_contribution = weight * engineer_rating",
    "module_keys": [
      "process_control_and_stability",
      "process_safety_management",
      "electrical_and_utilities_reliability",
      "critical_equipment_reliability",
      "flammable_liquids_and_fire_risk",
      "high_energy_materials_control",
      "high_energy_process_equipment",
      "safety_and_control_systems",
      "natural_hazard_exposure_and_controls",
      "emergency_response_and_bcp"
    ]
  },
  "industries": {
    "aircraft_painting_unfueled": {
      "modules": {
        "flammable_liquids_and_fire_risk": {
          "weight": 5,
          "help_text": "Aircraft painting generates high concentrations of flammable vapours. Treat the painting area as a spray-application environment: strict ignition control, disciplined solvent handling, and effective ventilation are essential to prevent flash fire/explosion."
        },
        "electrical_and_utilities_reliability": {
          "weight": 5,
          "help_text": "Electrical installations and temporary equipment within painting areas must be suitable for flammable vapour atmospheres. Non-suitable equipment and poor maintenance are common ignition pathways."
        },
        "critical_equipment_reliability": {
          "weight": 4,
          "help_text": "Ventilation and spray support systems are process-critical. Loss of extraction or interlocks can rapidly increase vapour accumulation risk and force an unsafe shutdown."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 3,
          "help_text": "Large hangar openings and lightweight envelopes can be vulnerable to wind and wind-driven rain. Confirm storm procedures, door management, and securing/anchoring arrangements where applicable."
        },
        "emergency_response_and_bcp": {
          "weight": 4,
          "help_text": "Emergency procedures should cover vapour ignition, spill response, safe shutdown, and protecting aircraft/assets during an incident."
        }
      }
    },

    "aluminium_manufacturing": {
      "modules": {
        "high_energy_materials_control": {
          "weight": 5,
          "help_text": "Molten aluminium operations can escalate rapidly following loss of containment, refractory degradation, or loss of control. Confirm spill routes, containment capacity, and that water is controlled away from molten pathways."
        },
        "electrical_and_utilities_reliability": {
          "weight": 5,
          "help_text": "Power reliability is critical for controlled operation and orderly shutdown. Loss of power can create severe equipment damage and difficult recovery; confirm redundancy and emergency arrangements."
        },
        "critical_equipment_reliability": {
          "weight": 5,
          "help_text": "Core process assets (pots/furnaces/casting/rolling) require disciplined inspection and monitoring. Confirm condition monitoring, maintenance planning, and critical spares for bottlenecks."
        },
        "flammable_liquids_and_fire_risk": {
          "weight": 4,
          "help_text": "Hydraulic fluids, lubricants, and coatings can create severe fire exposures near hot equipment. Confirm leak control, less flammable fluids where appropriate, and effective local protection/segregation."
        },
        "emergency_response_and_bcp": {
          "weight": 4,
          "help_text": "Emergency planning should include molten spill response, loss of utilities response, and recovery sequencing for critical equipment."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 1,
          "help_text": "Loss potential is typically driven by process incidents more than natural hazards; still confirm site-specific exposure and utility resilience."
        }
      }
    }
    ,

    "automotive_press_plant": {
      "modules": {
        "critical_equipment_reliability": {
          "weight": 5,
          "help_text": "Press integrity is central to production. Confirm preventive maintenance, alignment checks, load limiting, condition monitoring, and life-assessment practices to prevent sudden failures and long outages."
        },
        "electrical_and_utilities_reliability": {
          "weight": 5,
          "help_text": "Electrical failures stop presses and handling systems immediately. Confirm inspection/testing, condition monitoring, and that changes in load are managed with upgrades where required."
        },
        "flammable_liquids_and_fire_risk": {
          "weight": 3,
          "help_text": "Flammable liquid exposures exist (e.g., lubricants/hydraulics) but are generally secondary to mechanical/electrical drivers. Confirm ignition controls and leak management."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 5,
          "help_text": "Flooding of basements or floor-mounted electrical systems can cause severe business interruption. Confirm flood resilience, drainage, protection of critical rooms, and response capability."
        },
        "emergency_response_and_bcp": {
          "weight": 4,
          "help_text": "Contingency planning should cover press failure, electrical outage, and recovery with critical spares and safe restart procedures."
        }
      }
    },

    "automotive_body_plant": {
      "modules": {
        "critical_equipment_reliability": {
          "weight": 5,
          "help_text": "Robotics and automated handling are core to body production. Confirm protection of control cabinets, spares strategy, program backups, and recovery plans for key bottlenecks."
        },
        "electrical_and_utilities_reliability": {
          "weight": 5,
          "help_text": "High electrical dependency means even short outages can stop production. Confirm electrical condition monitoring and resilience for critical systems."
        },
        "flammable_liquids_and_fire_risk": {
          "weight": 4,
          "help_text": "Ignition sources (hot work, maintenance) and localized flammables can initiate fires. Confirm robust hot work controls, electrical maintenance, and housekeeping."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 5,
          "help_text": "Flood and severe weather can drive major interruption. Confirm protection of floor/below-grade electrical areas, storm readiness, and site access/egress resilience."
        },
        "emergency_response_and_bcp": {
          "weight": 4,
          "help_text": "Business continuity should address rapid restoration of automation capability, electrical recovery, and alternate production/logistics options."
        }
      }
    },

    "automotive_assembly_plant": {
      "modules": {
        "critical_equipment_reliability": {
          "weight": 5,
          "help_text": "Assembly lines are highly interdependent. Confirm reliability of automation/controls, availability of spares, and contingency plans for bottleneck equipment."
        },
        "electrical_and_utilities_reliability": {
          "weight": 5,
          "help_text": "Electrical and control reliability is critical for continuous operation. Confirm maintenance, monitoring, and management of changes in loading and protection settings."
        },
        "flammable_liquids_and_fire_risk": {
          "weight": 4,
          "help_text": "Fueling/finishing and localized processes introduce flammable liquid risk. Confirm shutoffs, spill control, drainage/containment, and ignition control during maintenance/hot work."
        },
        "process_control_and_stability": {
          "weight": 4,
          "help_text": "Control of in-process storage (including plastics), housekeeping, and storage arrangements reduces fire spread and operational disruption."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 5,
          "help_text": "Flood, wind, and hail can create major interruption and high-value damage (including yard/finished goods). Confirm resilience measures and response capability."
        },
        "emergency_response_and_bcp": {
          "weight": 4,
          "help_text": "Continuity planning should account for supply chain fragility, alternate logistics routes, and rapid restoration after utility disruption."
        }
      }
    },

    "chemical_manufacturing": {
      "modules": {
        "process_safety_management": {
          "weight": 5,
          "help_text": "Process safety management is foundational: hazard reviews, management of change, operating discipline, training, audits, and closure of findings prevent escalation."
        },
        "process_control_and_stability": {
          "weight": 5,
          "help_text": "Stable operation within defined safe limits is essential. Confirm procedures for normal/upset conditions, alarms, and operator response expectations."
        },
        "safety_and_control_systems": {
          "weight": 5,
          "help_text": "Safety-critical instrumentation and shutdown functions must be designed, tested, and maintained to perform under abnormal conditions."
        },
        "high_energy_process_equipment": {
          "weight": 4,
          "help_text": "Fired heaters and other high-energy equipment concentrate ignition/escalation risk. Confirm interlocks, trips, inspection regimes, and safe isolation."
        },
        "flammable_liquids_and_fire_risk": {
          "weight": 5,
          "help_text": "Loss of containment can lead to fire/explosion/toxic release. Confirm prevention layers (containment, drainage, isolation) and maintenance/testing of safeguards."
        },
        "electrical_and_utilities_reliability": {
          "weight": 4,
          "help_text": "Loss of utilities can create unsafe states. Confirm redundancy, safe shutdown capability, and emergency power where consequences are high."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 1,
          "help_text": "Major losses are typically process-driven; still confirm site-specific hazard exposure and resilience of utilities and containment."
        },
        "emergency_response_and_bcp": {
          "weight": 4,
          "help_text": "Emergency planning should address leak isolation, spill response, safe shutdown, and recovery sequencing, including competence across shifts."
        }
      }
    }
    ,

    "electrical_equipment_assembly": {
      "modules": {
        "electrical_and_utilities_reliability": {
          "weight": 5,
          "help_text": "Electrical assembly/testing depends on stable power and controlled environments. Power quality, humidity control, and clean electrical rooms reduce failures and rework."
        },
        "critical_equipment_reliability": {
          "weight": 4,
          "help_text": "Test rigs and production tooling can be bottlenecks. Confirm maintenance, calibration, spares, and program backups for fast recovery."
        },
        "process_control_and_stability": {
          "weight": 4,
          "help_text": "Contamination control and disciplined process steps prevent latent defects. Confirm housekeeping, ESD controls, and controlled storage/handling where applicable."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 4,
          "help_text": "Water ingress and humidity after storms/floods can cause widespread damage to sensitive components. Confirm building envelope resilience and response plans."
        },
        "emergency_response_and_bcp": {
          "weight": 3,
          "help_text": "Recovery often depends on restoring power and clean conditions. Confirm restart procedures and protection of critical documentation/programs."
        }
      }
    },

    "expanded_plastics_and_rubber": {
      "modules": {
        "flammable_liquids_and_fire_risk": {
          "weight": 5,
          "help_text": "Expanded plastics/rubber operations can have high fire load and rapid fire spread potential. Housekeeping, ignition control, and effective protection/segregation are key."
        },
        "process_control_and_stability": {
          "weight": 4,
          "help_text": "Combustible residues and deposits can accumulate; proactive cleaning and control of hot surfaces reduce ignition likelihood."
        },
        "electrical_and_utilities_reliability": {
          "weight": 4,
          "help_text": "Electrical faults are common ignition sources in high-dust/high-residue areas. Confirm inspection and suitable equipment for the environment."
        },
        "critical_equipment_reliability": {
          "weight": 4,
          "help_text": "Presses/mixers/foaming equipment are critical. Failures can cause extended downtime and may initiate fires."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 3,
          "help_text": "Flood/collapse can contaminate stock and create difficult recovery conditions. Confirm resilience and response planning."
        }
      }
    },

    "food_and_beverage_processing": {
      "modules": {
        "electrical_and_utilities_reliability": {
          "weight": 5,
          "help_text": "Power loss can cause rapid spoilage and loss of refrigeration. Confirm backup power, fuel logistics, and restoration plans."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 5,
          "help_text": "Flooding and severe weather can cause contamination and total product loss even with limited structural damage. Confirm resilience and response."
        },
        "critical_equipment_reliability": {
          "weight": 4,
          "help_text": "Bottleneck assets (refrigeration, ovens, cookers, packaging lines) drive downtime. Confirm maintenance, spares, and restart procedures."
        },
        "process_control_and_stability": {
          "weight": 4,
          "help_text": "Process stability and hygiene controls prevent contamination and unsafe temperature excursions. Confirm monitoring, alarms, and operator response."
        },
        "flammable_liquids_and_fire_risk": {
          "weight": 4,
          "help_text": "Fire can cause disproportionate contamination/smoke damage. Control ignition sources and maintain effective suppression to limit smoke spread and downtime."
        },
        "emergency_response_and_bcp": {
          "weight": 5,
          "help_text": "Continuity planning should address product protection/relocation, cold-chain continuity, and recovery under reduced staffing/access constraints."
        }
      }
    },

    "foundries_and_forges": {
      "modules": {
        "high_energy_materials_control": {
          "weight": 5,
          "help_text": "Molten metal handling creates extreme escalation potential, especially with refractory degradation or water contact. Confirm containment, spill routes, and keeping molten areas dry."
        },
        "electrical_and_utilities_reliability": {
          "weight": 5,
          "help_text": "Utilities/power support safe control and shutdown. Confirm redundancy, emergency power, and monitored cooling where required."
        },
        "critical_equipment_reliability": {
          "weight": 5,
          "help_text": "Furnaces, presses, and cranes are critical. Failures can cause severe damage and prolonged outage; confirm inspection and condition monitoring."
        },
        "flammable_liquids_and_fire_risk": {
          "weight": 4,
          "help_text": "Hydraulics/lubricants near hot operations can create severe fires. Confirm leak control and suitable local protection/segregation."
        },
        "emergency_response_and_bcp": {
          "weight": 4,
          "help_text": "Emergency procedures should address molten spills, power loss, and recovery with spare parts/refractory and trained response across shifts."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 4,
          "help_text": "Natural hazards can trigger utility loss and water ingress, which may escalate into molten incidents. Confirm resilience and response capability."
        }
      }
    },

    "glass_manufacturing": {
      "modules": {
        "high_energy_materials_control": {
          "weight": 5,
          "help_text": "Continuous molten glass processes can suffer severe damage during uncontrolled shutdowns or containment failures. Confirm refractory monitoring and containment."
        },
        "electrical_and_utilities_reliability": {
          "weight": 5,
          "help_text": "Reliable power/utilities are essential for safe shutdown and process control. Confirm emergency arrangements and orderly shutdown capability."
        },
        "critical_equipment_reliability": {
          "weight": 5,
          "help_text": "Melters, cooling, forming, and control systems are highly interdependent. Confirm monitoring, maintenance, and spare strategy for bottlenecks."
        },
        "emergency_response_and_bcp": {
          "weight": 4,
          "help_text": "Emergency response should address leaks, safe shutdown, and recovery sequencing including availability of repair materials and trained staff."
        },
        "natural_hazard_exposure_and_controls": {
          "weight": 1,
          "help_text": "Losses are usually process-driven; still confirm site-specific exposure and utility resilience."
        }
      }
    }

